server/tests/stress-test.yml
config:
  target: "${BASE_URL}"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 50
      rampTo: 100
      name: "Ramp up to 100 users per second"
    - duration: 300
      arrivalRate: 100
      name: "Sustain 100 users per second"
scenarios:
  - flow:
      - get:
          url: "${BASE_URL}/api/v1/health"
      - get:
          url: "${BASE_URL}/api/v1/welcome"